{
    "BP_Building_01_C": "This low building is mainly brown, made of brick, with gray vertical columns and a fire escape as distinctive features, likely an apartment.",
    "BP_Building_02_C": "This low building features a black glass upper section and gray stone base with old style, likely an apartment.",
    "BP_Building_03_C": "This medium - height building, primarily gray - green with brown accents, is made of brick, featuring dark brown vertical columns and a fire escape, likely an apartment.",
    "BP_Building_04_C": "This medium - height building, featuring a dark brown brick upper part and black metal - framed lower part with broken glass windows and a fire escape, is likely a residential and commercial building.",
    "BP_Building_05_C": "This low - rise building, with a red - brown brick upper part and black metal - framed lower part, features broken glass windows, weathered signage, and red awnings, indicating it's a shop.",
    "BP_Building_06_C": "This medium - height Residential building / apartment, made of brick, has a gray - brick upper part and red - brick base. It features a red - brick base with dark storefronts, AC units, fire escapes, and a green - awning over a door.",
    "BP_Building_07_C": "This high - rise building, with a red - brown brick upper section and beige glass - fronted base, features a green roof top and numerous air - conditioning units, likely an office Building.",
    "BP_Building_08_C": "This high - rise building, constructed from gray stone, features ornate carvings, tall windows, and a grand arched entrance, indicating it's an office Building.",
    "BP_Building_09_C": "This high - rise building, combining dark gray glass upper parts with light gray stone lower parts, features ornate stone detailing and a grand arched entrance, making it an office Building.",
    "BP_Building_10_C": "This high - rise commercial building has an all - glass facade with a grid pattern. It features a single rectangular entrance and reflective glass showing the sky and surroundings.",
    "BP_Building_11_C": "This medium - high building, with a pinkish - brown brick exterior, features ornate detailing, gold - colored entrance doors, and tall windows, indicating it's an office Building.",
    "BP_Building_12_C": "This medium - height building, constructed with brick, has a red - brick facade with gray accents. It features bay windows, gray stone accents, and gold - colored double doors, indicating it's an old style office Building.",
    "BP_Building_13_C": "This high - rise building, featuring a dark gray glass upper section and light gray stone - carved lower part with gold - framed entrance doors, is an office Building.",
    "BP_Building_14_C": "This high - rise building, with a red - brown brick upper part and gray stone base, features an arched stone entrance, bay windows, and ornate detailing, indicating it's an office Building.",
    "BP_Building_15_C": "This high - rise commercial building, made of concrete and glass, has a gray and white exterior with black accents. It features varied - size rectangular windows, a glass canopy over the entrance, and a dark - colored ground - floor facade.",
    "BP_Building_16_C": "This high - rise office Building, with a dark gray concrete exterior, features a set - back design on upper floors and curved corner windows.",
    "BP_Building_17_C": "This high - rise office Building, constructed from gray stone, features tall vertical columns, ornate arched entrances with gold - colored doors.",
    "BP_Building_18_C": "This high - rise office Building, made of stone, has a light - gray facade. It features ornate arched windows, gold - colored doors, and a dome - topped tower with intricate detailing.",
    "BP_Building_19_C": "This medium - high office Building, constructed with stone, has a light - gray facade. It features large windows with dark frames, tall stone columns, and gold - colored double doors at the entrance.",
    "BP_Building_20_C": "This high - rise office Building, constructed from light gray stone, features a clock tower, an ornate arched entrance, and detailed stone carvings.",
    "BP_Building_21_C": "This high - rise office Building has an all - glass facade with a grid pattern. It features a single rectangular entrance and reflective glass showing the sky and surroundings.",
    "BP_Building_22_C": "This medium - height office Building, made of gray concrete, features a horizontal striped facade, rectangular windows with dark frames, and a minimalist design.",
    "BP_Building_23_C": "This high - rise building, made of stone, has a light - gray facade with green and gold accents. It features grand columns, ornate arched windows with gold detailing, and a green - domed roof with golden ornamentation, indicating it's a government or institutional building.",
    "BP_Building_24_C": "This medium - height building, featuring a beige and gray exterior with red awnings, has curved balconies, graffiti, and a convenience store, indicating it's a residential and commercial building.",
    "BP_Building_25_C": "This high - rise building, with a gray and blue color scheme, features a blue - tiled lower section, signage for a convenience store and mini - supermarket, and various advertisements, indicating it's a residential and commercial building.",
    "BP_Building_26_C": "This high - rise building, with a gray concrete exterior, features red and orange window awnings, signage for a convenience store and electronics store, and graffiti on the side wall, indicating it's a residential and commercial building.",
    "BP_Building_27_C": "This medium - high buildinghas a weathered brown upper part and gray lower part. It features signs in Chinese characters, stacked boxes with a hand truck outside, and large ground - level windows with metal shutters, indicating it's a residential and commercial building.",
    "BP_Building_28_C": "This high - rise building, with a gray concrete base and reflective glass upper sections. It features a large red digital billboard, a small Chinese sign, and an outdoor kiosk with a blue umbrella, indicating it's a residential and commercial building.",
    "BP_Building_29_C": "This high - rise building has a weathered gray concrete facade. It features small striped awnings, colorful signs, and stacked boxes and packages outside., indicating it's an old residential and commercial building.",
    "BP_Building_30_C": "This medium - height building, constructed from gray concrete, features multiple ventilation units on the roof, a red tennis court, and a fenced - in area, indicating it's an educational or institutional building.",
    "BP_Building_31_C": "This low - rise parking structure features a multi - level design, a large tech wear billboard, and an entrance sign with 'WELCOME' and Chinese characters.",
    "BP_Building_32_C": "This high - rise building, with a beige and dark brown color scheme. It features a large red digital billboard with Chinese text, various Chinese - character signs, and construction materials outside, indicating it's a residential and commercial building.",
    "BP_Building_33_C": "This high - rise building has a dark gray - brown, exposed concrete facade. It features various Chinese - character signs, trash bins, carts, and metal shutters over some entrances, indicating it's a residential and commercial building.",
    "BP_Building_34_C": "This high - rise office Building has a weathered gray facade with darker streaks. It features large textured concrete panels, ground - level windows, a metal shutter, and stacked boxes outside.",
    "BP_Building_35_C": "This high - rise residential and commercial building, features a combination of brown brick and gray concrete. It has horizontal bands, small colorful signs, boxes and hand trucks outside, and a cylindrical tower.",
    "BP_Building_36_C": "This high - rise residential building has a mustard - yellow upper part and weathered gray lower part. It features a striped awning, metal shutters, stacked boxes with a hand truck, and visible pipes.",
    "BP_Building_37_C": "This high - rise residential and commercial building, constructed with concrete and brick, features a gray and brown color scheme, Chinese commercial signage, piled package and boxes near the entrance, and clotheslines with clothes.",
    "BP_Building_38_C": "This high - rise residential and commercial building, made of concrete, features a beige exterior with red accents, red - tiled awnings over windows, Chinese commercial signage and other stores, piled package and carts near the entrance, and roof - top equipment with red - tiled roofs.",
    "BP_Building_39_C": "This high - rise residential and commercial building, made of concrete, is gray in color and features Chinese - character signs, red awnings, stacked boxes with hand trucks, and clothes hanging outside upper - floor windows.",
    "BP_Building_40_C": "This high - rise residential and commercial building, constructed from concrete, has a brown and gray color scheme, large digital billboards, satellite dishes on the rooftop, and Chiense commercial signage.",
    "BP_Building_41_C": "This high - rise residential and commercial building, made of concrete and glass, features a curved pink brick lower part with white accents and red and green upper sections. It has multiple floors of windows and construction scaffolding on the green part.",
    "BP_Building_42_C": "This high - rise Residential / commercial building, constructed with concrete and glass, has a gray lower part, beige middle part, and an upper part under construction with steel and glass. It features Chinese - character signs and large glass windows.",
    "BP_Building_43_C": "This high - rise Residential building / apartment, made of concrete, has a light - gray lower part and reddish - brown upper part. It features various Chinese - character signs, metal shutters, and stacked boxes with hand trucks.",
    "BP_Building_44_C": "This high - rise Residential building / Hotel, constructed with concrete. It features colorful signs, boxes and debris on the rooftop, an exposed concrete texture, and small rectangular windows.",
    "BP_Building_45_C": "This high - rise office Building / commercial building, made of concrete and glass, features a gray and brown color scheme, large glass windows, green - tinted glass sections, and boxes and green trash bins outside the ground - floor area.",
    "BP_Building_46_C": "This high - rise office Building / commercial building, made of glass and concrete. It features large glass windows, a grid - like pattern of metal panels, and some windows with metal shutters.",
    "BP_Building_47_C": "This high - rise Residential / commercial building, made of concrete and glass, features a gray and green - tinted color scheme, large concrete panels, prominent columns.",
    "BP_Building_48_C": "This high - rise Residential building / apartment, made of concrete, has a gray and brown color scheme. It features a large tech wear billboard, metal shutters, an exposed concrete facade, and stacked boxes with hand trucks.",
    "BP_Building_49_C": "This high - rise Residential / commercial building, made of concrete and glass, features a gray color scheme, horizontal striped glass patterns, a rounded lower section with large windows, and boxes and utility containers outside.",
    "BP_Building_50_C": "This high - rise Residential building / apartment has a gray concrete and glass exterior. It features a large digital billboard with Chinese text, a modern glass facade, stacked boxes outside, and a satellite dish on the roof.",
    "BP_Building_51_C": "This high - rise residential building, made of concrete, has a white and light - gray exterior with green - tinted glass. It features large cylindrical columns, a modern glass facade, a checker - board pattern, and bicycles parked outside.",
    "BP_Building_52_C": "This high - rise Residential building / apartment, constructed with brick and concrete, has a pink exterior with dark pink tiles on the upper floors. It features Chinese - character signs, a striped awning, large glass windows, and stacked boxes with a hand truck outside.",
    "BP_Building_53_C": "This high - rise Residential building / apartment, made of brick and concrete, is brown in color, with rectangular vertical windows, commercial signages for stores, and boxes and a handcart outside the ground - floor shops.",
    "BP_Building_54_C": "This high - rise Residential building / apartment, made of concrete, is gray in color. It has small awnings over windows in red and orange, scaffolding on part of the facade, commercial signages.",
    "BP_Building_55_C": "This low - rise parking garage, made of concrete, features a brown and concrete - gray color scheme, an open - framed structure on upper floors, large Chinese characters on the facade, and boxes and a handcart outside.",
    "BP_Building_56_C": "This high - rise Residential building / apartment, made of concrete, is brown in color. It has small awnings in red and orange over some windows, a large billboard with Chinese characters and an NFT - related graphic, and boxes along with a small outdoor setup at the base.",
    "BP_Building_58_C": "This high - rise Residential building / apartment, made of concrete and brick, features a gray and brown color scheme. It has a large billboard with Chinese characters and an NFT - related graphic, small awnings in red and orange over some windows, and boxes and items outside.",
    "BP_Building_59_C": "This high - rise Residential building / apartment, made of concrete, has a red - brown and gray color scheme. It features scaffolding with green netting on the lower part, Chinese commercial signages, clothes drying outside windows, and boxes and a handcart outside.",
    "BP_Building_60_C": "This high - rise Residential building / apartment, made of concrete, is gray in color. It has Chinese commercial signages, boxes and a handcart outside.",
    "BP_Building_61_C": "This high - rise Residential building / apartment, made of concrete and glass, features a gray and blue color scheme. The upper section has blue tiles with large glass windows, and there are Chinese commercial signages. Boxes and a handcart are placed outside, and air - conditioning units are mounted on the exterior walls.",
    "BP_Building_62_C": "This high - rise Residential building / apartment, made of concrete, features a gray and white color scheme. It has large billboards advertising 'CHIMERA R - SPORT' and green - capped bottles with leaf motifs, boxes and packages outside, air - conditioning units on the exterior walls, and awnings in red and orange on some floors.",
    "BP_Building_63_C": "This low - rise mixed - use concrete building has a red - brown and gray color scheme, with commercial signages, graffiti, boxes, a handcart, clothes drying.",
    "BP_Building_64_C": "This low - rise mixed - use concrete building has a gray exterior, large billboards, commercial signages, boxes with a handcart outside, and AC units on the walls.",
    "BP_Building_65_C": "This high - rise Residential building / apartment, made of concrete and brick, features a gray and brown color scheme. It has Chinese commercial signages, boxes and hand - carts outside, air - conditioning units on the walls.",
    "BP_Building_66_C": "This medium  Residential building / apartment, made of concrete, has a brown and gray color scheme. It features Chinese commercial signages, graffiti on the exterior, boxes and a handcart outside, and a large red billboard with 'CHIMERA R - SPORT'.",
    "BP_Building_67_C": "This high - rise commercial building, made of concrete and glass. It features large arched columns, a modern glass facade, an open - plan interior, and green and white trash bins outside.",
    "BP_Building_68_C": "This high - rise Residential / office Building / commercial building, features a traditional red brick facade with white concrete accents. It has multiple rectangular windows with metal frames and a symmetrical design.",
    "BP_Building_69_C": "This high - rise building, constructed with concrete, is gray in color. It features regularly spaced rectangular windows, some with shutters, large ground - level glass windows, and a symmetrical design.",
    "BP_Building_70_C": "This high - rise office Building / commercial building. It has large glass windows, a cylindrical upper section with a window grid, and a symmetrical layout.",
    "BP_Building_71_C": "This high - rise office Building / commercial building, made of concrete and glass, is gray in color. It is likely a commercial or mixed - use structure, featuring large glass windows for natural light and a modern design with prominent columns at the base.",
    "BP_Building_72_C": "This high - rise office Building / commercial building, constructed with concrete, is dark gray in color. It features large glass windows, a speckled concrete exterior, visible interior columns, and a symmetrical design.",
    "BP_Building_73_C": "This high - rise office Building / commercial building, made of concrete and glass, features a modern design with a dark gray facade, black window frames, and extensive glass use. It has large windows, a brick - like texture on part of the exterior, and a geometric layout.",
    "BP_Building_74_C": "This high - rise office Building / commercial building, made of concrete and glass, is dark gray in color. It features rectangular windows, visible interior columns, and a simple, functional design.",
    "BP_Building_75_C": "This high - rise office Building / commercial building has a beige, stone - textured facade. It features large arched windows on the lower level, smaller rectangular windows above, and a symmetrical design.",
    "BP_Building_76_C": "This high - rise office Building / commercial building features a red - brick exterior with beige accents. It combines brick, concrete, and glass materials, showcasing a large glass facade at the base and brick - clad upper floors with beige horizontal bands.",
    "BP_Building_77_C": "This high - rise office Building / commercial building has a red brick facade with gray accents. It features large ground - floor glass windows, gray concrete columns, and curved corner details.",
    "BP_Building_78_C": "This low Clean laundry building, constructed with brick and concrete, features a red - brick exterior with beige accents. It has arched windows on multiple floors, an exposed metal fire escape, and a 'CLEAN LAUNDRY' sign on an adjacent building.",
    "BP_Building_79_C": "This medium office Building / commercial building, made of brick and glass, has a dark gray - brick exterior. It features large ground - floor glass windows with dark gray awnings and air conditioning units on upper - floor windows.",
    "BP_Building_80_C": "This medium office Building / commercial building, made of concrete and glass, is gray in color. It features uniform rectangular windows, horizontal architectural bands, and a modern, minimalist design.",
    "BP_Building_81_C": "This high - rise Residential building / apartment, constructed with brick and concrete, has a red - brick exterior with gray accents. It features green ground - floor doors, small windows nearby, oval decorations on the upper part, and wall - mounted lights.",
    "BP_Building_82_C": "This high - rise Residential building / apartment, constructed with brick and concrete, has a red - brick exterior with beige accents. It features uniform rectangular windows, a fire escape on the side, business names 'MILMOONS' and 'FIRE GRILL' on the ground floor, along with roll - up doors and glass storefronts.",
    "BP_Building_83_C": "This high - rise office Building / commercial building, made of brick and glass, has a red - brick exterior with gray accents. It features large vertical glass windows, a tree in front, the business name 'WAREN ENTERPRISES' on the side, and a dark overhang at the ground - floor level.",
    "BP_Building_84_C": "This high - rise Residential building / apartment, made of brick and concrete, has a gray - brick exterior. It features large green - framed glass openings, an arched central door, and a fire escape.",
    "BP_Building_85_C": "This high - rise office Building / commercial building, constructed with brick and concrete, has a gray - brick exterior. It features arched windows on the ground floor, rectangular windows on upper floors, black - framed windows, and wall - mounted light fixtures on the ground floor.",
    "BP_Building_86_C": "This high - rise Warehouse / Industrial Building, constructed with brick and concrete, has a red - brick exterior with beige accents. It features arched windows and doorways, a fire escape on the side, a green roof, and wall - mounted light fixtures.",
    "BP_Building_87_C": "This medium - height building, constructed with brick and concrete, has a red - brick exterior with gray accents. It is a hospital, featuring large glass windows for natural light, prominent signage for 'CENTRAL HOSPITAL' and 'EMERGENCY', and ramps and steps for accessibility.",
    "BP_Building_88_C": "This medium - height school, constructed with concrete, has a white exterior with gray accents. It features green - framed windows, a large central entrance with steps, and beige structural elements.",
    "BP_Building_89_C": "This high - rise building, constructed with steel, glass, and concrete, has a gray exterior with green accents. It features exposed steel framework, green - tinted glass windows, circular windows on the lower facade, and a modern, sleek design.",
    "BP_Building_90_C": "This high - rise office Building / commercial building, has a brown brick exterior with green and gray accents. It features a large music festival billboard, dark - framed windows, metal facade elements, and red - flagged flagpoles.",
    "BP_Building_91_C": "This high - rise office Building / commercial building gray concrete facade with green - tinted glass windows. It features horizontal panels, circular and rectangular elements, and a columned entrance area.",
    "BP_Building_92_C": "This high - rise office Building / commercial building, made of concrete and glass, has a white facade with green - tinted glass. It features horizontal overhangs, curved upper elements, and small angular roof structures.",
    "BP_Building_93_C": "This high - rise office Building / commercial building, constructed with concrete and glass, has a gray concrete exterior with green - tinted windows. It features dark gray bands, a curved driveway at the base, and cylindrical bollards.",
    "BP_Building_94_C": "This high - rise office Building / commercial building, constructed with concrete and glass, has a gray exterior with green accents. It features tall green - tinted glass towers with dark gray bands. It has large concrete columns and a modern, angular design.",
    "BP_Building_95_C": "This high - rise commercial building / Hotel features a brown brick facade with beige accents. It has arched ground - floor openings, green - tinted upper - floor windows and ornate brick details.",
    "BP_Building_96_C": "This high - rise commercial building features a combination of brown brick and gray concrete. It has numerous small upper - floor windows, large frosted - glass side windows, arched ground - floor doorways with decorative stone, and a prominent red and yellow billboard.",
    "BP_Building_97_C": "This high - rise commercial building features a combination of gray and black. It has large reflective glass windows, a prominent black 'NATASHA'S EST. 1998' sign, a 'Fizzy Cup' ad, and glass - framed ground - floor entrances.",
    "BP_Building_98_C": "This medium - height building features a combination of gray and green. It has large arched glass windows with green frames, tall classical columns, small green - domed corners, and intricate stone detailing.",
    "BP_Building_99_C": "This low - rise museum or exhibition hall features a combination of gray and green. It has large arched glass windows with brown frames, tall classical columns, ornate stone detailing, a grand staircase at the entrance.",
    "BP_Building_100_C": "This high - rise commercial or office building features a mix of brown, gray and beige. It has arched ground - floor windows, a stone - railed staircase leading to an entrance, and flagpoles with multiple flags (America, Germany, the UK).",
    "BP_Building_101_C": "This high - rise office building is gray in color. It features large arched ground - floor windows, a tall central clock - tower, and small circular windows on the facade.",
    "BP_Building_102_C": "This low - rise Museum / Exhibition Hall is gray in color. It features large arched windows with dark frames, tall classical columns, a grand staircase at the entrance, intricate stone detailing.",
    "BP_Building_103_C": "This high - rise commercial / office building is gray in color. It has numerous rectangular windows with dark frames, a large overhanging awning at the entrance, small decorative lanterns.",
    "BP_Building_104_C": "This high - rise commercial / office building features a combination of gray and blue. It has an extensive grid - like pattern of glass windows, large vertical steel columns, and multiple glass revolving doors at the entrance.",
    "BP_Building_105_C": "This medium - height commercial building features a combination of gray and black. It has large reflective glass windows, prominent 'MACBETH' and 'NATASHA'S EST. 1998' signage, a modern entrance awning, and exterior billboards.",
    "BP_Building_106_C": "This high - rise commercial / office building is gray in color. It features numerous rectangular and arched windows, ornate stone detailing, a central arched entrance with a revolving door, and tall ground - floor columns.",
    "BP_Building_107_C": "This high - rise commercial or office building is gray in color. It has uniform rows of rectangular windows, vertical light fixtures on the facade, metal - gated entrances, and a tall central tower with a pointed roof.",
    "BP_Building_108_C": "This high - rise Commercial / Office building features a combination of gray and green. It has large arched windows with dark frames, ornate stone detailing, small decorative lanterns, and a green - domed roof structure at the top.",
    "BP_Building_109_C": "This high - rise Commercial / Office building features a combination of gray and beige. It has rectangular windows with dark frames, American flags on the facade, large glass - framed entrances.",
    "BP_Building_110_C": "This high - rise Commercial / Office building is gray in color. It features large glass - framed entrances with dark frames, textured stone - like patterns on the facade, and a uniform architectural design across floors.",
    "BP_Building_111_C": "This high - rise commercial building features a combination of green and black. It has abundant grid - like glass windows, numerous colorful billboards on the facade, and a modern, sleek architectural design.",
    "BP_Building_112_C": "This high - rise commercial building is gray in color. It features rectangular windows with dark frames, large vertical billboards, circular lower - facade windows, and brightly lit 'CLASH' digital signs.",
    "BP_Building_113_C": "This medium - height commercial building is gray in color. It features tall vertical columns, large arched glass windows, red 'SUPERDRIP' banners, and a modern overhanging entrance with glass doors.",
    "BP_Building_114_C": "This medium - height commercial building features a combination of gray and white. It has arched glass windows, colorful vertical banners, a modern overhanging glass structure, and solar panels on the roof.",
    "BP_Building_115_C": "This high - rise Commercial / Office building features a combination of gray and brown. It has a uniform grid of rectangular windows, dark - framed glass entrance doors, small decorative lanterns, ornate stone detailing.",
    "BP_Building_116_C": "This medium - height Commercial / Office building features a combination of gray and beige. It has large rectangular windows with dark frames, ornate classical columns, American flags, gray awnings on the ground floor.",
    "BP_Building_117_C": "This high - rise Commercial / Office building is gray in color. It features vertical lines of rectangular windows, large glass - framed entrances, prominent vertical concrete columns.",
    "BP_Building_118_C": "This high - rise Commercial / Office building is gray in color. It features American flags on the facade, a sleek modern design, and a uniform grid - like window pattern.",
    "BP_Building_119_C": "This high - rise Commercial / Office building features a combination of gray and black. It has a unique geometric entrance with dark framing, a sleek modern design, and a uniform facade with subtle texture variations.",
    "BP_Building_121_C": "This high - rise commercial building features a combination of gray and green. It has abundant grid - like glass windows, large colorful billboards, a modern sleek design, and curved glass - framed sections on the lower facade.",
    "BP_Building_122_C": "This high - rise commercial building features a combination of green and black. It has diagonal structural steel lines creating a dynamic facade pattern, large advertising billboards, and a modern minimalist entrance with a small overhang.",
    "BP_Building_123_C": "This low - rise Entertainment / Event venue features a combination of gray and glass - reflective surfaces. It has a large circular glass - domed roof, prominent steel arch structures, numerous colorful billboards, a modern entrance with steps and an overhang, and a glass - paneled facade.",
    "BP_Building_124_C": "This medium - height Commercial / Office building features a combination of brown and gray. It has arched windows with gray stone detailing, small gray awnings on the ground floor, a large central arched glass entrance, and ornate architectural details.",
    "BP_Building_125_C": "This high - rise Commercial / Office building features a combination of gray and black. It has vertical lines of rectangular windows, a unique geometric entrance with dark framing, a sleek modern design, and a uniform facade with subtle texture variations.",
    "BP_Building_126_C": "This high - rise commercial building features a combination of gray, green and black. It has abundant grid - like glass windows, large colorful billboards, a modern sleek design, and a distinct green - tinted facade section."
}